Calculation with Missing Data

In [23]:
import numpy as np
import pandas as pd
array = np.array([3, None, 0, 4, None])
print(array)

[3 None 0 4 None]

In [24]:
import numpy as np
import pandas as pd
array = np.array([3, np.nan, 0, 4, np.nan])
print(array)

[ 3. nan  0.  4. nan]

Cleaning Missing Data

In [25]:
#Import the libraries
import numpy as np
import pandas as pd

# Create a CSV dataset
data_string = '''ID,Gender,Salary,Country,Company
1,Male,15000,India,Google
2,Female,45000,China,NaN
3,Female,25000,India,Google
4,NaN,NaN,Australia,Google
5,Male,NaN,India,Google
6,Male,54000,NaN,Alibaba
7,NaN,74000,China,NaN
8,Male,14000,Australia,NaN
9,Female,15000,NaN,NaN
10,Male,33000,Australia,NaN'''

with open('salary.csv', 'w') as out:
    out.write(data_string)

# Import the dataset
df = pd.read_csv('/content/salary.csv')
print('Salary Dataset: \n', df)

# Check for missing data
print('Missing Data\n', df.isna())

print('Missing Data\n', df.isnull())

# Print only missing data
print('Filter based on columns: \n', df[df.isnull().any(axis=1)])

# Sum up the missing values
print('Sum up the missing values: \n', df.isnull().sum())

Salary Dataset:
    ID  Gender   Salary    Country  Company
0   1    Male  15000.0      India   Google
1   2  Female  45000.0      China      NaN
2   3  Female  25000.0      India   Google
3   4     NaN      NaN  Australia   Google
4   5    Male      NaN      India   Google
5   6    Male  54000.0        NaN  Alibaba
6   7     NaN  74000.0      China      NaN
7   8    Male  14000.0  Australia      NaN
8   9  Female  15000.0        NaN      NaN
9  10    Male  33000.0  Australia      NaN
Missing Data
       ID  Gender  Salary  Country  Company
0  False   False   False    False    False
1  False   False   False    False     True
2  False   False   False    False    False
3  False    True    True    False    False
4  False   False    True    False    False
5  False   False   False     True    False
6  False    True   False    False     True
7  False   False   False    False     True
8  False   False   False     True     True
9  False   False   False    False     True
Missing Data
       ID  Gender  Salary  Country  Company
0  False   False   False    False    False
1  False   False   False    False     True
2  False   False   False    False    False
3  False    True    True    False    False
4  False   False    True    False    False
5  False   False   False     True    False
6  False    True   False    False     True
7  False   False   False    False     True
8  False   False   False     True     True
9  False   False   False    False     True
Filter based on columns:
    ID  Gender   Salary    Country  Company
1   2  Female  45000.0      China      NaN
3   4     NaN      NaN  Australia   Google
4   5    Male      NaN      India   Google
5   6    Male  54000.0        NaN  Alibaba
6   7     NaN  74000.0      China      NaN
7   8    Male  14000.0  Australia      NaN
8   9  Female  15000.0        NaN      NaN
9  10    Male  33000.0  Australia      NaN
Sum up the missing values:
 ID         0
Gender     2
Salary     2
Country    2
Company    5
dtype: int64

Dropping Missing Data

In [26]:
df.dropna(inplace=True)
print(df)

   ID  Gender   Salary Country Company
0   1    Male  15000.0   India  Google
2   3  Female  25000.0   India  Google

Replacing Missing Data

In [27]:
df["Salary"].fillna(20000, inplace=True)
print(df)

   ID  Gender   Salary Country Company
0   1    Male  15000.0   India  Google
2   3  Female  25000.0   India  Google

Important Functions for Handling Missing Data in Pandas

isnull()

In [28]:
#Import the libraries
import numpy as np
import pandas as pd

# Create a CSV dataset
data_string = '''ID,Gender,Salary,Country,Company
1,Male,15000,India,Google
2,Female,45000,China,NaN
3,Female,25000,India,Google
4,NaN,NaN,Australia,Google
5,Male,NaN,India,Google
6,Male,54000,NaN,Alibaba
7,NaN,74000,China,NaN
8,Male,14000,Australia,NaN
9,Female,15000,NaN,NaN
10,Male,33000,Australia,NaN'''

with open('salary.csv', 'w') as out:
    out.write(data_string)

# Import the dataset
df = pd.read_csv('salary.csv')

print('Missing Data\n', df.isnull())

Missing Data
       ID  Gender  Salary  Country  Company
0  False   False   False    False    False
1  False   False   False    False     True
2  False   False   False    False    False
3  False    True    True    False    False
4  False   False    True    False    False
5  False   False   False     True    False
6  False    True   False    False     True
7  False   False   False    False     True
8  False   False   False     True     True
9  False   False   False    False     True

In [29]:
gender = pd.isnull(df["Gender"])
gender

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7    False
8    False
9    False
Name: Gender, dtype: bool

notnull()

In [30]:
print('Non Missing Data\n', df.notnull())

Non Missing Data
      ID  Gender  Salary  Country  Company
0  True    True    True     True     True
1  True    True    True     True    False
2  True    True    True     True     True
3  True   False   False     True     True
4  True    True   False     True     True
5  True    True    True    False     True
6  True   False    True     True    False
7  True    True    True     True    False
8  True    True    True    False    False
9  True    True    True     True    False

dropna()

In [31]:
print('Drop Missing Company Data\n', df.Company.dropna())
df.dropna()

Drop Missing Company Data
 0     Google
2     Google
3     Google
4     Google
5    Alibaba
Name: Company, dtype: object

   ID  Gender   Salary Country Company
0   1    Male  15000.0   India  Google
2   3  Female  25000.0   India  Google

In [32]:
df.dropna(axis = 1)
print(df)

   ID  Gender   Salary    Country  Company
0   1    Male  15000.0      India   Google
1   2  Female  45000.0      China      NaN
2   3  Female  25000.0      India   Google
3   4     NaN      NaN  Australia   Google
4   5    Male      NaN      India   Google
5   6    Male  54000.0        NaN  Alibaba
6   7     NaN  74000.0      China      NaN
7   8    Male  14000.0  Australia      NaN
8   9  Female  15000.0        NaN      NaN
9  10    Male  33000.0  Australia      NaN

In [33]:
new_df = df.dropna(axis = 0, how ='any')
print(new_df)

   ID  Gender   Salary Country Company
0   1    Male  15000.0   India  Google
2   3  Female  25000.0   India  Google

fillna()

In [34]:
print('Fill Missing Data\n', df.fillna(0))

Fill Missing Data
    ID  Gender   Salary    Country  Company
0   1    Male  15000.0      India   Google
1   2  Female  45000.0      China        0
2   3  Female  25000.0      India   Google
3   4       0      0.0  Australia   Google
4   5    Male      0.0      India   Google
5   6    Male  54000.0          0  Alibaba
6   7       0  74000.0      China        0
7   8    Male  14000.0  Australia        0
8   9  Female  15000.0          0        0
9  10    Male  33000.0  Australia        0

In [35]:
print('Fill Missing Data\n', df.fillna(method ='pad'))

Fill Missing Data
    ID  Gender   Salary    Country  Company
0   1    Male  15000.0      India   Google
1   2  Female  45000.0      China   Google
2   3  Female  25000.0      India   Google
3   4  Female  25000.0  Australia   Google
4   5    Male  25000.0      India   Google
5   6    Male  54000.0      India  Alibaba
6   7    Male  74000.0      China  Alibaba
7   8    Male  14000.0  Australia  Alibaba
8   9  Female  15000.0  Australia  Alibaba
9  10    Male  33000.0  Australia  Alibaba

In [36]:
print('Fill Missing Data\n', df.fillna(method ='bfill'))

Fill Missing Data
    ID  Gender   Salary    Country  Company
0   1    Male  15000.0      India   Google
1   2  Female  45000.0      China   Google
2   3  Female  25000.0      India   Google
3   4    Male  54000.0  Australia   Google
4   5    Male  54000.0      India   Google
5   6    Male  54000.0      China  Alibaba
6   7    Male  74000.0      China      NaN
7   8    Male  14000.0  Australia      NaN
8   9  Female  15000.0  Australia      NaN
9  10    Male  33000.0  Australia      NaN

In [37]:
print('Fill Missing Data\n', df["Gender"].fillna("No Gender", inplace = True))

Fill Missing Data
 None

replace()

In [38]:
print(df.replace(to_replace = 'Google', value = 'Microsoft'))

   ID     Gender   Salary    Country    Company
0   1       Male  15000.0      India  Microsoft
1   2     Female  45000.0      China        NaN
2   3     Female  25000.0      India  Microsoft
3   4  No Gender      NaN  Australia  Microsoft
4   5       Male      NaN      India  Microsoft
5   6       Male  54000.0        NaN    Alibaba
6   7  No Gender  74000.0      China        NaN
7   8       Male  14000.0  Australia        NaN
8   9     Female  15000.0        NaN        NaN
9  10       Male  33000.0  Australia        NaN

interpolate()

In [39]:
print(df.interpolate(method ='linear', limit_direction ='forward'))

   ID     Gender        Salary    Country  Company
0   1       Male  15000.000000      India   Google
1   2     Female  45000.000000      China      NaN
2   3     Female  25000.000000      India   Google
3   4  No Gender  34666.666667  Australia   Google
4   5       Male  44333.333333      India   Google
5   6       Male  54000.000000        NaN  Alibaba
6   7  No Gender  74000.000000      China      NaN
7   8       Male  14000.000000  Australia      NaN
8   9     Female  15000.000000        NaN      NaN
9  10       Male  33000.000000  Australia      NaN